; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v4 - type_1 ?v5 - type_2)
 	      (pred_4 ?v6 - object ?v5 - type_2)
	      (pred_2 ?v4 - type_1 ?v1 - type_3)
	      (pred_3 ?v4 - type_1 ?v6 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v4 - type_1 ?v8 ?v7 - type_2)
       :precondition (and  (pred_1 ?v4 ?v8))
       :effect (and  (pred_1 ?v4 ?v7)
		     (not (pred_1 ?v4 ?v8))))

   (:action op_1
       :parameters (?v4 - type_1 ?v3 - object ?v2 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v3 ?v2) (pred_1 ?v4 ?v2) (pred_2 ?v4 ?v1))
       :effect (and (pred_3 ?v4 ?v3 ?v1)
		    (not (pred_4 ?v3 ?v2)) 
		    (not (pred_2 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_1 ?v3 - object ?v2 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v3 ?v1) (pred_1 ?v4 ?v2))
       :effect (and (pred_4 ?v3 ?v2)
		    (pred_2 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v3 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_10 - type_1
obj_12 obj_08 obj_01 obj_03 - type_3
obj_13 obj_02 obj_09 obj_07 - type_2
obj_04 obj_11 obj_05 - object)
(:init
(pred_1 obj_06 obj_09)
(pred_2 obj_06 obj_12)
(pred_2 obj_06 obj_08)
(pred_1 obj_10 obj_02)
(pred_2 obj_10 obj_01)
(pred_2 obj_10 obj_03)
(pred_4 obj_04 obj_02)
(pred_4 obj_11 obj_02)
(pred_4 obj_05 obj_09)
)
(:goal
(and
(pred_4 obj_04 obj_07)
(pred_4 obj_11 obj_02)
(pred_4 obj_05 obj_13)
)
)

(:constraints
  (always (not (pred_1 obj_06 obj_13)))
)
)

; plan
1. (op_1 obj_10 obj_04 obj_02 obj_03)
   deleted: (pred_4 obj_04 obj_02) (pred_2 obj_10 obj_03)
   added: (pred_3 obj_10 obj_04 obj_03)
   goals met: 1 of 3
2. (op_1 obj_06 obj_05 obj_09 obj_08)
   deleted: (pred_4 obj_05 obj_09) (pred_2 obj_06 obj_08)
   added: (pred_3 obj_06 obj_05 obj_08)
   goals met: 1 of 3
3. (op_3 obj_10 obj_02 obj_07)
   deleted: (pred_1 obj_10 obj_02)
   added: (pred_1 obj_10 obj_07)
   goals met: 1 of 3
4. (op_3 obj_06 obj_09 obj_07)
   deleted: (pred_1 obj_06 obj_09)
   added: (pred_1 obj_06 obj_07)
   goals met: 1 of 3
5. (op_2 obj_10 obj_04 obj_07 obj_03)
   deleted: (pred_3 obj_10 obj_04 obj_03)
   added: (pred_4 obj_04 obj_07) (pred_2 obj_10 obj_03)
   goals met: 2 of 3
6. (op_2 obj_06 obj_05 obj_07 obj_08)
   deleted: (pred_3 obj_06 obj_05 obj_08)
   added: (pred_4 obj_05 obj_07) (pred_2 obj_06 obj_08)
   goals met: 2 of 3
7. (op_1 obj_10 obj_05 obj_07 obj_03)
   deleted: (pred_4 obj_05 obj_07) (pred_2 obj_10 obj_03)
   added: (pred_3 obj_10 obj_05 obj_03)
   goals met: 2 of 3
8. (op_3 obj_10 obj_07 obj_13)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_13)
   goals met: 2 of 3
9. (op_2 obj_10 obj_05 obj_13 obj_03)
   deleted: (pred_3 obj_10 obj_05 obj_03)
   added: (pred_4 obj_05 obj_13) (pred_2 obj_10 obj_03)
   goals met: 3 of 3
